IDEA Connection Link
ConnectionLink.OpenIdeaConnectionWithName Method
 Opens the application Idea Connection and waits till this application is closed
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void OpenIdeaConnectionWithName(
	Action<IIOMSettings, IDEAProgress> myCreateIOM,
	IdeaConImportSettings IdeaConImportSettings,
	IDEAProgress IDEAProgress,
	ref string nameOfFile
)
Public Sub OpenIdeaConnectionWithName (
	myCreateIOM As Action(Of IIOMSettings, IDEAProgress),
	IdeaConImportSettings As IdeaConImportSettings,
	IDEAProgress As IDEAProgress,
	ByRef nameOfFile As String
)
public:
void OpenIdeaConnectionWithName(
	Action<IIOMSettings^, IDEAProgress^>^ myCreateIOM,
	IdeaConImportSettings^ IdeaConImportSettings,
	IDEAProgress^ IDEAProgress,
	String^% nameOfFile
)
Parameters
myCreateIOM
Type: System.Action<IIOMSettings, IDEAProgress>
Callback function of IOM creation
IdeaConImportSettings
Type: IdeaConImportSettings
IdeaConImportSettings
IDEAProgress
Type: IDEAProgress
IDEAProgress
nameOfFile
Type: System.String
Returns name of file
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace